import Card from "./Card"
import './Cards.css'
const Cards = () => {
    return (
        <div className="cards grid grid-cols-1 gap-3 sm:grid-cols-3 xl:gap-8 lg:gap-5 sm:gap-3 mt-8">
            <Card title={'لوکیشن مناسب مراسم عروسی'}>
                <p>خدمات ویژه ی آیتم های خوراکی زیر نظر آشپزهای بین المللی و داخلی در محیطی کاملا بهداشتی و تحت نظارت وزارت بهداشت که باعث اطمینان و رضایت کارفرمایان عزیز میباشد</p>
            </Card>

            <Card title={'کترینگ و پذیرایی مراسم عروسی'}>
                <p>آماده سازی و ارائه ی ده ها نوع فینگرفود گرم و یا فینگر فود سرد ، با استفاده از تازه ترین مواد اولیه، مطابق با اصول بهداشتی ، توسط سرآشپز های دوره دیده و مجرب مجموعه، جهت پذیزایی هرچه بهتر از مدعوین شما دوستان عزیز.</p>
            </Card>

            <Card title={'دکوراسیون انحصاری مراسم عروسی'}>
                <p>ایده پردازی طراحی و ساخت دکوراسیون زورنالی انحصاری مناسب مراسم شما که در کمترین زمان ممکن با استفاده از بهترین متریال و المان های خاص توسط تیم تشریفاتی فاوو ایونت.</p>
            </Card>
        </div>
    )
}

export default Cards