import Image from 'next/image'
import './WhyFavo.css'
import IconBox from './IconBox'


const WhyFavo = () => {
    return (
        <>
            <div className='why' >
                <div className="why-favo">
                    <div className='flex flex-col justify-between why-favo-layer relative'>
                        <svg className="why-favo-svg absolute top-0" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1000 100" preserveAspectRatio="none">
                            <path fill="#0F0F0F" style={{ height: 40 }} d="M262.1,5.3L1000,100V0H0v100L262.1,5.3z"></path>
                        </svg>
                        <div className='why-favo-layer-content'>
                            <div>
                                <h2 className='text-white text-4xl text-center mt-12 font-extrabold'>چرا فاوو ایونت؟</h2>
                            </div>
                            <div className='flex mt-12'>
                                <div className=' w-1/2' >
                                    <IconBox title={'اجرای مراسم انحصاری'}>
                                        <p>فاوو ایونت ،با تکیه به تخصص خود در برگزاری انحصاری و خاص مراسم‌ ها به سبک‌های اروپایی و مجلل جز توانمندترین شرکت‌های شناخته شده در بین رقبای تجاری خود بوده و سابقه چندین اجرای موفق داخلی و بین‌المللی، مهر تایید خدمات خاص فاوو ایونت می‌باشد. سفارشی سازی اجرای منحصر به فرد تمامی آیتم‌ها، مناسب ایده و نظر شما میزبانان است.</p>
                                    </IconBox>
                                    <IconBox title={'اجرای صفر تا صد مراسم انحصاری'}>
                                        <p>فاووایونت در برنامه‌ریزی و اجرای صفر تا صد مجالس تشریفات که از مهمترین آنها تیم ایده پردازی و اجرا،تیم موسیقی حرفه‌ای،تیم دیزاین دکوراسیون همچنین بهره‌مندی از کترینگ خصوصی می‌باشد. بدون نیاز به برون سپاری آیتم‌های مورد نیاز شما مناسب‌ترین انتخاب برای اجرای بی‌ عیب و نقص انواع مراسم عقد،عروسی،نامزدی،سالگرد بوده و خواهد بود.</p>
                                    </IconBox>
                                    <IconBox title={'سرعت عمل'}>
                                        <p>قدرت سرعت عمل و سازماندهی حرفه‌ای تیم فاو یکی از ویژگی‌هایی بوده که شما را از برنامه‌ریزی طولانی مدت و استرس نجات می‌دهد. مفتخریم که در کمترین زمان ممکن ؛ متنوع ترین و لوکس‌ترین خدمات تشریفات را برای شما اجرا خواهیم کرد.</p>
                                    </IconBox>
                                </div>
                                <div className=' w-1/2' >
                                    <IconBox title={'تنوع لوکیشن ها'} direction={'left'} >
                                        <p className='text-left'>ارائه خدمات تشریفاتی نامحدود در بیش از ۵۰ لوکیشن اعم از عمارت،روف گاردن ، باغ ، سالن ، تالار و حتی لوکیشن‌ های مخصوص شما عزیزان از ویژگی‌های فاوو ایونت می‌باشد. انتخاب مناسب ترین محیط اجرایی مراسم باعث اجرای هرچه بهتر مجالس شما شده و موجب تفاوت ویژه مابین مراسم شماو دیگر مجالس خواهد شد.</p>
                                    </IconBox>
                                    <IconBox title={'عدم محدودیت'} direction={'left'}>
                                        <p className='text-left'>فاوو ایونت برای تحقق اهداف و رضایت ۱۰۰ درصدی شما میزبانان این امکان را در اختیار شما می‌گذارد که تمام جزئیات و کلیات مجالس تشریفات خود را در کنار تیم ایده پردازی فاوا طراحی کنید و از تمایز مراسم خود با دیگر مراسمات لذت ببرید. شام،دیزاین، گل آرایی،ماشین عروس،موزیک از جمله آیتم‌هایی هستند که شما به طور کامل می‌توانید نسبت به سلیقه و ایده خود انتخاب کنید.</p>
                                    </IconBox>
                                    <IconBox title={'تضمین اجرای  عالی مراسم'} direction={'left'}>
                                        <p className='text-left'>تضمین اجرای دقیق و بی‌عیب و نقص در تمامی عناوین تشریفاتی مورد نظر در صورت انتخاب عناوین اجرایی صفر تا ۱۰۰ در این موارد مسئولیت اجرای کل مراسم بر عهده تیم امنیتی و اجرایی فاو بوده و هیچ مانعی برای برگزاری مجالس شما پیش نخواهد آمد</p>
                                    </IconBox>
                                </div>
                            </div>
                        </div>
                        <svg className="why-favo-svg absolute bottom-0" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1000 100" preserveAspectRatio="none">
                            <path fill="#0F0F0F" style={{ height: 80 }} d="M737.9,94.7L0,0v100h1000V0L737.9,94.7z">
                            </path>
                        </svg>
                    </div>

                </div>
            </div>

        </>
    )
}

export default WhyFavo